Revit 2027 API
BuiltInFailures.SheetFailures Class
 Failures about Sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SheetFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SheetFailures
Public NotInheritable Class SheetFailures
public ref class SheetFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SheetFailures = class end
The BuiltInFailures.SheetFailures type exposes the following members.
Properties
Name | Description
SheetNumberDuplicated |  Sheet Number is already in use. Enter a unique number.
SheetNumberDuplicatedPerSheetCollection |  Sheet Number is already in use. The same Sheet Number value can be used once for all sheets directly in the model, and once for all sheets per Sheet Collection.
SheetNumberEmpty |  Sheet Number is empty
SheetScaleOverrideInvalid |  The scale override parameter can only contain text, numeric values are not supported.
Top
See Also
Reference
Autodesk.Revit.DB Namespace